class CairoLinesCorrdinates{

  static Map<String, String> metroLine1Coordinates() {
    Map<String, String> metroLine1Coordinates = {
      "Helwan": "29.84903736119006,31.33423752699516",
      "Ain Helwan": "29.86267458956478,31.325052634767143",
      "Helwan University": "29.869851393571782,31.319648635072106",
      "Wadi Hof": "29.879126538506355,31.313567241694653",
      "Hadayek Helwan": "29.897321402536715,31.304206737071468",
      "El-Maasara": "29.906392257121617,31.29954396827793",
      "Tora El-Balad": "29.946876646437012,31.27298910465672",
      "Kozzika": "29.936430585578005,31.281451661253538",
      "Tora ElAsmant": "29.925973501152576,31.28754625346665",
      "Sakanat ElMaadi": "29.953292118861153,31.26296199720143",
      "Maadi": "29.960342917786658,31.257637307857202",
      "Hadayek ElMaadi": "29.969992670385217,31.250811476627565",
      "Dar ElSalam": "29.982061686271564,31.24231317469022",
      "ElZahraa": "29.995513640789056,31.231180465913802",
      "Mar Girgis": "30.00611532143133,31.229627777173285",
      "El-Malek ElSaleh": "30.017684059509136,31.231220248191676",
      "AlSayeda Zeinab": "30.02929789246813,31.235438607042855",
      "Saad Zaghloul": "30.037029922797835,31.23833804620185",
      "Sadat": "30.044129052218047,31.234433850931318",
      "Nasser": "30.053497136289057,31.2387399486692",
      "Orabi": "30.05668037133046,31.2420699976144",
      "AlShohadaa": "30.06106992046829,31.246057125172463",
      "Ghamra": "30.069054704852153,31.26463563213536",
      "ElDemerdash": "30.077316353366353,31.27781229124498",
      "Manshiet ElSadr": "30.081997555984643,31.287537692810563",
      "Kobri ElQobba": "30.08718414160959,31.29411744290364",
      "Hammamat ElQobba": "30.091219081333755,31.2989307032774",
      "Saray ElQobba": "30.097632695870367,31.304554147990988",
      "Hadayeq ElZaitoun": "30.10585608498135,31.31048380409617",
      "Helmeyet ElZaitoun": "30.113251031712153,31.31397014843506",
      "ElMatareyya": "30.12131861830261,31.313740489882196",
      "Ain Shams": "30.13104078468673,31.31909280990519",
      "Ezbet ElNakhl": "30.13929806402633,31.32441992874097",
      "ElMarg": "30.152050394378318,31.335682068039823",
      "New ElMarg": "30.163618359624618,31.338345584019827",
    };

    return metroLine1Coordinates;
  } //done


  static Map<String, String> metroLine2Coordinates() {
    Map<String, String> metroLine2Coordinates = {};
    metroLine2Coordinates['Shobra ElKheima'] = '30.12224225798257,31.24443716536811';
    metroLine2Coordinates['Kolleyyet ElZeraa'] = '30.113714185018274,31.24868292989835';
    metroLine2Coordinates['Mezallat'] = '30.104182586810847,31.24562414920438';
    metroLine2Coordinates['Khalafawy'] = '30.09789607555925,31.24539415336153';
    metroLine2Coordinates['St. Teresa'] = '30.08795160733788,31.24548959931378';
    metroLine2Coordinates['Rod ElFarag'] = '30.080589343190677,31.245412872390176';
    metroLine2Coordinates['Massara'] = '30.070901990972583,31.245103301568424';
    metroLine2Coordinates['AlShohadaa'] = '30.06106992046829,31.246057125172463';
    metroLine2Coordinates['Attaba'] = '30.05233597308318,31.246795683320414';
    metroLine2Coordinates['Mohamed Naguib'] = '30.045325405514745,31.244159745399173';
    metroLine2Coordinates['Sadat'] = '30.044129052218047,31.234433850931318';
    metroLine2Coordinates['Opera'] = '30.041952643641874,31.22497455031182';
    metroLine2Coordinates['Dokki'] = '30.038432079810242,31.212233222386256';
    metroLine2Coordinates['Bohooth'] = '30.03580176297431,31.20016697820741';
    metroLine2Coordinates['CairoUniversity'] = '30.02600373947895,31.20116942825512';
    metroLine2Coordinates['Faisal'] = '30.017360945976815,31.203935185750414';
    metroLine2Coordinates['Giza'] = '30.01065584720426,31.207087935111314';
    metroLine2Coordinates['Omm ElMasryeen'] = '30.00564951534086,31.208124891006083';
    metroLine2Coordinates['Sakiat Mekki'] = '29.995491964138203,31.20864929094024';
    metroLine2Coordinates['ElMounib'] = '29.98110225916312,31.212336612229258';
    return metroLine2Coordinates;
  }

  static Map<String, String> metroLine3Coordinates() {
    Map<String, String> metroLine3Coordinates = {
      "Road El Farg Corr": "30.10190989339181,31.18443476887509",
      "Ring Road": "30.096436204240455,31.19957496154549",
      "El Qumia": "30.093243411138406,31.209015865290002",
      "El Bohy": "30.08212470598578,31.210551397385398",
      "Imbaba": "30.075849192590763,31.20745519619157",
      "Sudan": "30.070089263060304,31.204705593218478",
      "KitKat": "30.06655933608745,31.21301257656363",
      "Safay Hegazy": "30.062268041069913,31.223297859633735",
      "Maspero": "30.055701946915768,31.232115481245565",
      "Nasser": "30.053507874692166,31.238736914888786",
      "Attaba": "30.052359292738558,31.24678431031718",
      "Bab El Shaaria": "30.054132043308126,31.255909339812927",
      "El Geish": "30.06173781897152,31.266885049885264",
      "Abdou Pasha": "30.064796568469745,31.27470388360256",
      "Abbasia": "30.072005453041363,31.283362803691247",
      "Cairo Fair": "30.0733734683471,31.30098199011045",
      "Stadium": "30.072943184506745,31.317099714339914",
      "Kolleyet ElBanat": "30.084063374530945,31.329004072861526",
      "Al Ahram": "30.091783963542465,31.3262925051496",
      "Haroun": "30.101537049663246,31.33300219159074",
      "Heliopolis": "30.108473252129592,31.338327106406293",
      "Alf Maskan": "30.119010620454404,31.340184365632673",
      "Nadi El Shams": "30.125513322722618,31.34891613259467",
      "Al Nozha": "30.127959919525487,31.360178589070863",
      "Hesham Barkat": "30.13085100901205,31.37289445119273",
      "Qubaa": "30.134836167768402,31.383742032938756",
      "Omar Ebn El Khattab": "30.140362112263343,31.394360837128424",
      "El Hayikstep": "30.14387145849703,31.404690072211803",
      "Adly Mansour": "30.147068153833473,31.421197940368376",
    };

    return metroLine3Coordinates;
  }
  static Map<String, String> allStationsEnglish = {
    ...CairoLinesCorrdinates.metroLine1Coordinates(),
    ...CairoLinesCorrdinates.metroLine2Coordinates(),
    ...CairoLinesCorrdinates.metroLine3Coordinates(),
  };
  static Map<String, String> metroLine1CoordinatesArabic() {
    Map<String, String> metroLine1Coordinates = {
      "حلوان": "29.84903736119006,31.33423752699516",
      "عين حلوان": "29.86267458956478,31.325052634767143",
      "جامعة حلوان": "29.869851393571782,31.319648635072106",
      "وادي حوف": "29.879126538506355,31.313567241694653",
      "حدائق حلوان": "29.897321402536715,31.304206737071468",
      "المعصرة": "29.906392257121617,31.29954396827793",
      "طرة الأسمنت": "29.946876646437012,31.27298910465672",
      "كوتسيكا": "29.936430585578005,31.281451661253538",
      "طرة البلد": "29.925973501152576,31.28754625346665",
      "سكنات المعادي": "29.953292118861153,31.26296199720143",
      "المعادي": "29.960342917786658,31.257637307857202",
      "حدائق المعادي": "29.969992670385217,31.250811476627565",
      "دار السلام": "29.982061686271564,31.24231317469022",
      "الزهراء": "29.995513640789056,31.231180465913802",
      "مار جرجس": "30.00611532143133,31.229627777173285",
      "الملك الصالح": "30.017684059509136,31.231220248191676",
      "السيدة زينب": "30.02929789246813,31.235438607042855",
      "سعد زغلول": "30.037029922797835,31.23833804620185",
      "السادات": "30.044129052218047,31.234433850931318",
      "ناصر": "30.053497136289057,31.2387399486692",
      "عرابي": "30.05668037133046,31.2420699976144",
      "الشهداء": "30.06106992046829,31.246057125172463",
      "غمرة": "30.069054704852153,31.26463563213536",
      "الدمرداش": "30.077316353366353,31.27781229124498",
      "منشية الصدر": "30.081997555984643,31.287537692810563",
      "كوبري القبة": "30.08718414160959,31.29411744290364",
      "حمامات القبة": "30.091219081333755,31.2989307032774",
      "سراي القبة": "30.097632695870367,31.304554147990988",
      "حدائق الزيتون": "30.10585608498135,31.31048380409617",
      "حلمية الزيتون": "30.113251031712153,31.31397014843506",
      "المطرية": "30.12131861830261,31.313740489882196",
      "عين شمس": "30.13104078468673,31.31909280990519",
      "عزبة النخل": "30.13929806402633,31.32441992874097",
      "المرج": "30.152050394378318,31.335682068039823",
      "المرج الجديدة": "30.163618359624618,31.338345584019827",
    };

    return metroLine1Coordinates;
  }
  static Map<String, String> metroLine2CoordinatesArabic() {
    Map<String, String> metroLine2Coordinates = {};
    metroLine2Coordinates['شبرا الخيمة'] = '30.12224225798257,31.24443716536811';
    metroLine2Coordinates['كلية الزراعة'] = '30.113714185018274,31.24868292989835';
    metroLine2Coordinates['مظلات'] = '30.104182586810847,31.24562414920438';
    metroLine2Coordinates['خلفاوي'] = '30.09789607555925,31.24539415336153';
    metroLine2Coordinates['سانت تيريز'] = '30.08795160733788,31.24548959931378';
    metroLine2Coordinates['روض الفرج'] = '30.080589343190677,31.245412872390176';
    metroLine2Coordinates['المسرة'] = '30.070901990972583,31.245103301568424';
    metroLine2Coordinates['الشهداء'] = '30.06106992046829,31.246057125172463';
    metroLine2Coordinates['العتبه'] = '30.05233597308318,31.246795683320414';
    metroLine2Coordinates['محمد نجيب'] = '30.045325405514745,31.244159745399173';
    metroLine2Coordinates['السادات'] = '30.044129052218047,31.234433850931318';
    metroLine2Coordinates['الأوبرا'] = '30.041952643641874,31.22497455031182';
    metroLine2Coordinates['الدقي'] = '30.038432079810242,31.212233222386256';
    metroLine2Coordinates['البحوث'] = '30.03580176297431,31.20016697820741';
    metroLine2Coordinates['جامعة القاهرة'] = '30.02600373947895,31.20116942825512';
    metroLine2Coordinates['فيصل'] = '30.017360945976815,31.203935185750414';
    metroLine2Coordinates['الجيزة'] = '30.01065584720426,31.207087935111314';
    metroLine2Coordinates['أم المصريين'] = '30.00564951534086,31.208124891006083';
    metroLine2Coordinates['ساقية مكي'] = '29.995491964138203,31.20864929094024';
    metroLine2Coordinates['المنيب'] = '29.98110225916312,31.212336612229258';
    return metroLine2Coordinates;
  }
  static Map<String, String> metroLine3CoordinatesArabic() {
    Map<String, String> metroLine3Coordinates = {
      "محور روض الفرج": "30.10190989339181,31.18443476887509",
      "طريق الدائري": "30.096436204240455,31.19957496154549",
      "القومية": "30.093243411138406,31.209015865290002",
      "البوهي": "30.08212470598578,31.210551397385398",
      "إمبابة": "30.075849192590763,31.20745519619157",
      "السودان": "30.070089263060304,31.204705593218478",
      "الكيت كات": "30.06655933608745,31.21301257656363",
      "صفاء حجازي": "30.062268041069913,31.223297859633735",
      "ماسبيرو": "30.055701946915768,31.232115481245565",
      "ناصر": "30.053507874692166,31.238736914888786",
      "العتبه": "30.052359292738558,31.24678431031718",
      "باب الشعريه": "30.054132043308126,31.255909339812927",
      "الجيش": "30.06173781897152,31.266885049885264",
      "عبده باشا": "30.064796568469745,31.27470388360256",
      "عباسية": "30.072005453041363,31.283362803691247",
      "معرض القاهرة": "30.0733734683471,31.30098199011045",
      "استاد": "30.072943184506745,31.317099714339914",
      "كلية البنات": "30.084063374530945,31.329004072861526",
      "الأهرام": "30.091783963542465,31.3262925051496",
      "هارون": "30.101537049663246,31.33300219159074",
      "هيليوبوليس": "30.108473252129592,31.338327106406293",
      "ألف مسكن": "30.119010620454404,31.340184365632673",
      "نادي الشمس": "30.125513322722618,31.34891613259467",
      "النزهة": "30.127959919525487,31.360178589070863",
      "هشام بركات": "30.13085100901205,31.37289445119273",
      "قباء": "30.134836167768402,31.383742032938756",
      "عمر بن الخطاب": "30.140362112263343,31.394360837128424",
      "الهايكستب": "30.14387145849703,31.404690072211803",
      "عدلي منصور": "30.147068153833473,31.421197940368376",
    };

    return metroLine3Coordinates;
  }


  static Map<String, String> allStationsArabic = {
    ...CairoLinesCorrdinates.metroLine1CoordinatesArabic(),
    ...CairoLinesCorrdinates.metroLine2CoordinatesArabic(),
    ...CairoLinesCorrdinates.metroLine3CoordinatesArabic(),
  };

  static Map<String, String> getMetroStationsCoordinates(String language) {
    if (language.trim() == 'ar') {
      return allStationsArabic; // Return English list if language is English
    } else {
      return allStationsEnglish; // Default to Arabic
    }
  }
}